tutorials/compressible/rhoPorousSimpleFoam/porousPlug/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 -0.1)
    (3 0 -0.1)
    (3 1 -0.1)
    (0 1 -0.1)
    (0 0 0.1)
    (3 0 0.1)
    (3 1 0.1)
    (0 1 0.1)   // 7
    (5 0 -0.1)
    (5 1 -0.1)
    (5 0 0.1)   // 10
    (5 1 0.1)
    (8 0 -0.1)
    (8 1 -0.1)
    (8 0 0.1)
    (8 1 0.1)  //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) air (60 20 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) poro (40 20 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) air (60 20 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (12 14 15 13)
    )
    wall upperWall
    (
        (2 3 7 6)
        (2 6 11 9)
        (9 11 15 13)
    )
    wall lowerWall
    (
        (1 5 4 0)
        (1 5 10 8)
        (10 8 12 14)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
